package funtion;

public class Function1 {
	public static void main(String[] args) {
		//자바에는 막혀있지만 함수라는 개념이 있다
		//함수 : 코드를 저장하는 공간(){}
		//변수 : 값을 저장하는 공간 
		System.out.println();   //출력을 해주는 함수 (출력하는 코드가 저장되어 있음)
		
		
		//자바에서는 험수를 직접적으로 사용하지 않고 
		//클래스 안에 담아서 메서드라는 개념으로 사용
		//우선은 편하게 "함수 ++메서드"  간주
		//static : 정적, 고정시켜놓아서 어디서든지 접근할수 있게끔 셋팅(많이 쓰면 프로그램이 느려짐)
		
		
		
	}
	static void 함수명 () {}
	//함수라는 것은 사용자가 직접 만드는 연산자( 코드저장)
	//
		
		
	}

/*자바는 클래스 바깥에서 코딩하는 것을 허락하지 않음  ]
	왜냐면 자바의 출시 목적이 모든 프로그램밍 언어를 통합하기 위해서 출시
	
	int num = 0;
	
	public void mm(){
 
 */
	
