package varlable;

public class Type1 {
	public static void main(String[] args) {
		// 개발자가 의도를 정확리 하거나 
		// 컴파일러가 오류를 검출하기 위해 자료형이라는 것을 사용
		
		
		// int : 숫자 (정수)
		// double : 소수점 (실수)
		// string 글자 (문자열)
		// char : 한글자 (문자) 
		// boolean : 참거짓
		
		//변수를 만들떄 글자를 저장하는 공간을 만들고 싶다
		
		String 변수1;
		
		//숫자를 저장하는 변수를 만들고 싶다
		int 변수2;
		
		//소수점이 있는 숫자를 저장하는 변수르 만등고 싶
		double 변수3;
		
		//명제를 구하는 변수르 만듬
		boolean 변수4;
		
		//변수 생성 : 자료형 변수형 
		
		// 변수에 데이터 값을 넣고자 하면 = 
		변수1 =  "문자열은 큰다옴표";
		변수2 =  314;
		변수3 = 3.14;
		변수4 = false;
		
		//만약에 자료형이 맞지않은 값을 넣어주려고 하면 오류가 발생
		
		Sting 변수2 = "숫자형 공간을 만들었는데 문자열을 넣으려한다? 오류검출";
				
				
	    
				
		        //변수선언 따로 대입 피곤쓰 한번에 
		        //변수 초기화 선언 대입 같이
				
		 char 변수5 = 'a';
		String 변수6 ="자료형 적고 변수형 적은 다음 값을 대압 하면 초기화";
		 
		// 변수 선언은 반드시 자료형ㅇ 들어거야험 
		//변수 대입 또는 사용 하려면 자료형x
		string = 변수7;  // 변수 선언
		변수7 = "";기존에 만들어진 공간 대입
		System.out.println(변수7);  // 기존애 만들어진 공간을 사용
		
		//변수명 중복 불가능
		String 변수8;
		String 변수8; xxx
		
		
		
		
		
	}

}
